module.exports = {
  mtData: mtData,
  searchmtdataByName: searchmtdataByName,
  searchmtdataByID: searchmtdataByID,
}
var mt_data = mtData()

function searchmtdataByName(name) {
  var result = [];
  if (!Boolean(name))
    return result;
  for (let i = 0; i < mt_data.list.length; i++) {
    var mt = mt_data.list[i]
    if (mt.name.indexOf(name) > -1) {
      result.push(mt)
    }
  }
  return result || []
}

function searchmtdataByID(id) {
  var result = {};
  if (!Boolean(id))
    return result;
  for (let i = 0; i < mt_data.list.length; i++) {
    var mt = mt_data.list[i]
    if (mt.id == id) {
      result = mt;
      break;
    }
  }
  return result || {};
}

function mtData() {
  var arr = {
    list: [{
        id: '01',
        name: '鸣人',
        fullName: '旋涡鸣人',
        img: 'https://jinuss.github.io/blog/jinus/role/mr.jpeg',
        brief: '',
        sex: 1,
        attribute: "火、风、雷、土、水、阳",
        village: "木叶",
        story: [{
            'p': '主角。火之国木叶隐村的忍者，四代火影水门和玖辛奈之子，六道仙人次子阿修罗转世。因为九尾和孤儿备受歧视，但在伊鲁卡以及三代火影鼓励下有了要成为火影的梦想，让所有人都认同他的存在。后来和卡卡西、佐助和小樱组成第七班进行各种任务。'
          },
          {
            'p': '为实现梦想和守护伙伴们的羁绊，鸣人不断修炼变强，作为自来也的弟子，在追求梦想的过程中不断突破自我，贯彻了自身的忍道，获得人们的认可。最后与伙伴们一同终结了第四次忍界战争，并实现自己成为(七代)火影的梦想!'
          }
        ],
        skills: [{
          type: "体术",
          val: "千年杀、影分身冲刺、鸣人连弹、手里剑、瞬身之术"
        }, {
          type: "忍术",
          val: "影分身、通灵术、螺旋丸、螺旋手里剑瞬、土流壁"
        }, {
          type: "仙术",
          val: "蛙组手、忍术、蛙叩、怪力无双、明神门"
        }, {
          type: "外道",
          val: "恶意感知、尾兽之力、尾兽玉、求道玉、阴阳遁"
        }, {
          type: "组合忍术",
          val: "飓风水涡术、蛤蟆铁炮、蛤蟆油炎弹、地爆天星"
        }, ]
      },
      {
        id: '02',
        name: '佐助',
        fullName: '宇智波佐助',
        img: 'https://jinuss.github.io/blog/jinus/role/zz.jpeg',
        brief: '',
        sex: 1,
        attribute: "火、风、雷、土、水、阴",
        village: "木叶",
        story: [{
          p: "男二。火之国木叶隐村宇智波一族的天才忍者，六道仙人长子因陀罗的转世者。"
        }, {
          p: "年幼时目睹宇智波一族被哥哥鼬全灭，从而走上复仇之路。后叛离木叶并追随大蛇丸。三年后，佐助将大蛇丸吸收到异空间，并成功向鼬复仇，但之后得知了鼬的灭族真相，于是决定摧毁木叶。后来，佐助与秽土转生的鼬相遇，想法再次发生了变化，为了进一步了解忍者、家族、哥哥的过去，佐助与秽土转生的历代火影进行交谈，决定继承鼬的意志守护木叶，并希望成为火影改变木叶的政治体制"
        }, {
          p: "第四次忍界大战结束后，佐助在终结之谷与鸣人进行了最后一战，于回归木叶，并重新成为木叶的一员。"
        }, {
          p: "此后佐助独自一人游历世界，暗中默默守护着木叶。"
        }],
        skills: [{
          type: "忍具",
          val: "草雉剑"
        }, {
          type: "体术",
          val: "瞬身术、影舞叶、狮子连弹"
        }, {
          type: "忍术",
          val: "豪火球术、凤仙火术、龙火术、千鸟、麒麟、手里剑术"
        }, {
          type: "组合忍术",
          val: "灼遁光轮疾风"
        }, {
          type: "仙术",
          val: "须佐能乎"
        }, {
          type: "幻术",
          val: "写轮眼、轮回眼"
        }, {
          type: "通灵术",
          val: "潜影蛇手、蛇睨咒缚、雷光剑化、万蛇、加尔达、青蛇"
        }, {
          type: "封印术",
          val: "解邪法印"
        }, {
          type: "血继限界",
          val: "瞳术（写轮眼、轮回眼、天照、炎遁）、须佐能乎"
        }, ]
      },
      {
        id: '03',
        name: '鼬',
        fullName: "宇智波鼬",
        img: 'https://jinuss.github.io/blog/jinus/role/you.png',
        brief: '',
        sex: 1,
        attribute: "火、风、水、阴、阳",
        village: "木叶",
        story: [{
          p: "重要人物。火之国木叶隐村宇智波一族的成员，宇智波佐助的哥哥。是宇智波一族的天才忍者，年幼时跟宇智波止水是挚友，实力强大，擅长幻术。为了保护村子免受战乱，被迫接受了灭族任务，留下了弟弟佐助并刺激他向自己复仇，之后加入晓组织做卧底。最终在与弟弟宇智波佐助的战斗中为佐助注入瞳力后，因身体患有不治之症，体力不支而死亡。"
        }, {
          p: "第四次忍界大战中被药师兜以秽土转生形式复活，在和漩涡鸣人与奇拉比的战斗中由于使用了万花筒写轮眼，触发了原本留给鸣人体内装有止水左眼的乌鸦并对鼬使用了别天神，从而让鼬摆脱秽土转生的控制，后与佐助合力击败药师兜，最终秽土转生解除后，灵魂升天。"
        }],
        skills: [{
            type: "忍具",
            val: "手里剑、苦无、武士刀"
          },
          {
            type: "灵器",
            val: "十拳剑、八咫镜"
          },
          {
            type: "忍术",
            val: "火遁、水遁、别天神、天照、须佐能乎"
          },
          {
            type: "幻术",
            val: "镜天地转、写轮眼"
          },
          {
            type: "体术",
            val: "怪力、瞬身术"
          },
          {
            type: "通灵术",
            val: "乌鸦"
          },
          {
            type: "血继限界",
            val: "写轮眼、月读、天照、须佐能乎、八坂勾玉、伊耶那美"
          }
        ]
      },
      {
        id: '04',
        name: '卡卡西',
        fullName: "旗木卡卡西",
        img: 'https://jinuss.github.io/blog/jinus/role/kkx.jpg',
        brief: '',
        sex: 1,
        attribute: "火、风、雷、土、水、阳、阴",
        village: "木叶",
        story: [{
            p: "主要角色。火之国木叶隐村的精英上忍，原木叶暗部成员，四代目火影波风水门的弟子，木叶第七班队长，漩涡鸣人、宇智波佐助、春野樱的老师。年仅12岁时就成为上忍的天才忍者，后左眼移植宇智波带土的写轮眼，因使用写轮眼复制了上千种忍术而被称为“拷贝忍者”、“写轮眼卡卡西”，其名号响彻各国。"
          },
          {
            p: "第四次忍界大战中，不幸被宇智波斑将左眼写轮眼夺去，所幸被鸣人使用阴阳遁将左眼复原。带土死前通过查克拉将写轮眼再次赋予卡卡西而可以短暂使用完整的万花筒写轮眼力量，能够使出完全体须佐能乎，并借此在最终决战与第七班三位弟子一起将大筒木辉夜封印。战争结束后成为了木叶第六代目火影，数年后卸任，由鸣人当第七代火影，和迈特凯两人启程旅行，去寻找曾经的回忆。"
          }
        ],
        skills: [{
            type: "血继限界",
            val: "写轮眼、雷切、须佐能乎"
          },
          {
            type: "时空间忍术",
            val: "神威、通灵术"
          },
          {
            type: "攻击型忍术",
            val: "千鸟、雷遁、紫电、螺旋丸、豪火球、水遁等"
          },
          {
            type: "辅助型忍术",
            val: "影分身"
          },
          {
            type: "体术",
            val: "瞬身术、影舞叶、八门遁甲"
          },
          {
            type: "幻术",
            val: "写轮眼"
          }
        ]
      },
      {
        id: '05',
        name: '自来也',
        fullName: "自来也",
        img: 'https://jinuss.github.io/blog/jinus/role/zly.jpg',
        brief: '',
        sex: 1,
        attribute: "火、风、土、水、阴、阳",
        village: "木叶",
        story: [{
          p: "主要角色。江湖人称“好色仙人”，火之国木叶隐村的“三忍”之一，三代目火影猿飞日斩的弟子，四代目火影波风水门、长门、弥彦、小南、七代目火影漩涡鸣人的师父，被鸣人称为一生中最敬重的人。他指导鸣人修行，在鸣人成长的道路上起到重要作用。后到雨忍村刺探情报，结果不幸死于“晓”首领佩恩之手。"
        }],
        skills: [{
            type: "忍术",
            val: "火遁忍术、土遁忍术、结界、螺旋丸及其它"
          },
          {
            type: "忍法",
            val: "针地狱、蛙变之术"
          },
          {
            type: "封印术",
            val: "封火印法、四肢重封、指刻封印"
          },
          {
            type: "通灵术",
            val: "妙木山蛤蟆、蛤蟆口束缚术、蛤蟆见世术"
          },
          {
            type: "仙法",
            val: "毛针千本、超大玉螺旋丸、五右卫门、蛤蟆临唱"
          }
        ]
      },
      {
        id: '06',
        name: '纲手',
        fullName: "纲手",
        img: 'https://jinuss.github.io/blog/jinus/role/gs.jpg',
        brief: '',
        sex: 0,
        attribute: "火、雷、土、水、阳",
        village: "木叶",
        story: [{
          p: "纲手，女性角色，火之国木叶隐村的五代目火影，初代火影千手柱间及其妻子漩涡水户的孙女（或外孙女），也是传说中的“三忍”中的一点红，最重要的人是恋人加藤断与弟弟绳树。擅长体术和医疗忍术。"
        }, {
          p: "受自来也的请求，回村就任第五代火影。在后来的佩恩袭击等事件中保护着木叶。在后来的第四次忍界大战中担任忍者联军总参谋，发挥着重大作用。"
        }],
        skills: [{
            type: "体术",
            val: "怪力、天守脚"
          },
          {
            type: "忍术",
            val: "医疗术（掌仙术）、蛞蝓、百豪之术"
          },
          {
            type: "通灵术",
            val: "蛞蝓大分裂、蛞蝓共享、蛞蝓空间转换术、舌齿黏酸"
          },
          {
            type: "禁术",
            val: "创造再生、百豪之术、阴封印、四赤阳阵"
          }
        ]
      },
      {
        id: '07',
        name: '斑',
        fullName: "宇智波斑",
        img: 'https://jinuss.github.io/blog/jinus/role/b.jpeg',
        brief: '',
        sex: 1,
        attribute: "火、雷、土、水、阳",
        village: "木叶",
        story: [{
          p: "宇智波一族的前任首领，是前任六道仙人长子因陀罗转世者。同时也是宇智波一族实力最强的男人，擅长使用“须佐能乎”以及“完全体须佐能乎”，被世人将其和千手柱间称之为“传说中的忍者”。"
        }, {
          p: "和千手柱间合作建立了第一个忍村，并将其命名为“木叶”。在黑绝的蛊惑下与千手柱间在终结之谷交战，结果被千手柱间击败，普遍被世人认为已经死亡，事实上在临死前向右眼植入了伊邪那岐而存活并获得了柱间的细胞。利用柱间的细胞在临死前开启轮回眼，制造出外道魔像和上一次无限月读开启后产生的白绝，将轮回眼移植于长门身上。第三次忍界大战时期，在神无毗桥之战中救下宇智波带土，计划利用他进行月之眼计划。"
        }, {
          p: "第四次忍界大战时期被药师兜用秽土转生复活。后利用带土施展外道·轮回天生之术完全复活，吸收了十尾后成为了十尾人柱力，发动无限月读后遭到黑绝背叛。大筒木辉夜被封印后由于体内尾兽被抽离处于濒死状态，与柱间敞开心扉后而彻底死亡。"
        }],
        skills: [{
            type: "体术",
            val: "瞬身术、体术"
          },
          {
            type: "忍术",
            val: "火遁、分身忍术、时空间忍术、封印忍术、其它忍术"
          },
          {
            type: "幻术",
            val: "写轮眼、无限月读"
          },
          {
            type: "通灵术",
            val: "九喇嘛、外道魔像"
          }, {
            type: "封印术",
            val: "魔像之锁，紧箍咒符"
          }, {
            type: "血继限界",
            val: "木遁、瞳术、忍术"
          }, {
            type: "血继网罗",
            val: "轮回写轮眼、树界降诞"
          }, {
            type: "六道仙术",
            val: "岚遁光牙、阴遁雷派"
          }, {
            type: "忍具",
            val: "焰团扇、镰刀、黑棒"
          }
        ]
      }
    ]
  }
  return arr
}